app/controllers/publications_controller.rb

INSERT INTO "publications" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hola"], ["description", "1234"], ["user_id", 1], ["created_at", "2023-07-06 06:41:48.032224"], ["updated_at", "2023-07-06 06:41:48.032224"]]
---
  def create
    @publication = Publication.new(publication_params)

    respond_to do |format|
      if @publication.save